#### OpenTofu Format and Style 🖌``
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # openstack_compute_instance_v2.container-host will be created
  + resource "openstack_compute_instance_v2" "container-host" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + created             = (known after apply)
      + flavor_id           = "592bcbc2-456b-484b-bdd0-12bcb85c1dae"
      + flavor_name         = (known after apply)
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "654bf798-579b-47aa-a7f7-8a8798c9779d"
      + image_name          = (known after apply)
      + name                = "container-host"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false
      + updated             = (known after apply)
      + user_data           = "2602b57de6b240f43dc41e61c1f5c11151f913fa"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_networking_floatingip_associate_v2.container-host will be created
  + resource "openstack_networking_floatingip_associate_v2" "container-host" {
      + fixed_ip    = (known after apply)
      + floating_ip = (known after apply)
      + id          = (known after apply)
      + port_id     = (known after apply)
      + region      = (known after apply)
    }

  # openstack_networking_floatingip_v2.container-host will be created
  + resource "openstack_networking_floatingip_v2" "container-host" {
      + address    = (known after apply)
      + all_tags   = (known after apply)
      + dns_domain = (known after apply)
      + dns_name   = (known after apply)
      + fixed_ip   = (known after apply)
      + id         = (known after apply)
      + pool       = "public"
      + port_id    = (known after apply)
      + region     = (known after apply)
      + subnet_id  = (known after apply)
      + tenant_id  = (known after apply)
    }

  # openstack_networking_network_v2.container will be created
  + resource "openstack_networking_network_v2" "container" {
      + admin_state_up          = true
      + all_tags                = (known after apply)
      + availability_zone_hints = (known after apply)
      + dns_domain              = (known after apply)
      + external                = (known after apply)
      + id                      = (known after apply)
      + mtu                     = (known after apply)
      + name                    = "02-container"
      + port_security_enabled   = (known after apply)
      + qos_policy_id           = (known after apply)
      + region                  = (known after apply)
      + shared                  = (known after apply)
      + tenant_id               = (known after apply)
      + transparent_vlan        = (known after apply)

      + segments (known after apply)
    }

  # openstack_networking_port_v2.container-host will be created
  + resource "openstack_networking_port_v2" "container-host" {
      + admin_state_up         = true
      + all_fixed_ips          = (known after apply)
      + all_security_group_ids = (known after apply)
      + all_tags               = (known after apply)
      + device_id              = (known after apply)
      + device_owner           = (known after apply)
      + dns_assignment         = (known after apply)
      + dns_name               = (known after apply)
      + id                     = (known after apply)
      + mac_address            = (known after apply)
      + name                   = "container-host"
      + network_id             = (known after apply)
      + port_security_enabled  = (known after apply)
      + qos_policy_id          = (known after apply)
      + region                 = (known after apply)
      + security_group_ids     = (known after apply)
      + tenant_id              = (known after apply)

      + binding (known after apply)

      + fixed_ip {
          + subnet_id = (known after apply)
        }
    }

  # openstack_networking_router_interface_v2.container will be created
  + resource "openstack_networking_router_interface_v2" "container" {
      + force_destroy = false
      + id            = (known after apply)
      + port_id       = (known after apply)
      + region        = (known after apply)
      + router_id     = (known after apply)
      + subnet_id     = (known after apply)
    }

  # openstack_networking_router_v2.container will be created
  + resource "openstack_networking_router_v2" "container" {
      + admin_state_up          = true
      + all_tags                = (known after apply)
      + availability_zone_hints = (known after apply)
      + distributed             = (known after apply)
      + enable_snat             = (known after apply)
      + external_network_id     = "3cc83f7d-9119-475b-ba17-f3510c7902e8"
      + id                      = (known after apply)
      + name                    = "02-container"
      + region                  = (known after apply)
      + tenant_id               = (known after apply)

      + external_fixed_ip (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.portainer-ui will be created
  + resource "openstack_networking_secgroup_rule_v2" "portainer-ui" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 9443
      + port_range_min    = 9443
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.ssh will be created
  + resource "openstack_networking_secgroup_rule_v2" "ssh" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 22
      + port_range_min    = 22
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_v2.container will be created
  + resource "openstack_networking_secgroup_v2" "container" {
      + all_tags    = (known after apply)
      + description = "Allow traffic to Portainer UI on port 9443 and SSH from anywhere."
      + id          = (known after apply)
      + name        = "02-container"
      + region      = (known after apply)
      + stateful    = (known after apply)
      + tenant_id   = (known after apply)
    }

  # openstack_networking_subnet_v2.container will be created
  + resource "openstack_networking_subnet_v2" "container" {
      + all_tags          = (known after apply)
      + cidr              = "10.0.10.0/24"
      + enable_dhcp       = true
      + gateway_ip        = (known after apply)
      + id                = (known after apply)
      + ip_version        = 4
      + ipv6_address_mode = (known after apply)
      + ipv6_ra_mode      = (known after apply)
      + name              = "02-container"
      + network_id        = (known after apply)
      + no_gateway        = false
      + region            = (known after apply)
      + service_types     = (known after apply)
      + tenant_id         = (known after apply)

      + allocation_pool (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @dependabot[bot], Action: `pull_request`, Working Directory: ``, Workflow: `CI 🚧`*